XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_adc.h
/**
  * @brief    读取SCAN ACQ采样时间
  * @rmtoll   SCANACQ_CR    SMTS    FL_ADC_GeSCANACQSamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeSCANACQSamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_SMTS_Msk));
}

/**
  * @brief    获取ACQ0转换数据
  * @rmtoll   ACQ0_DR    RESULT    FL_ADC_ReadACQ0ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ0ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ0_DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ1转换数据
  * @rmtoll   ACQ1_DR    RESULT    FL_ADC_ReadACQ1ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ1ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ1_DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ2转换数据
  * @rmtoll   ACQ2_DR    RESULT    FL_ADC_ReadACQ2ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ2ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ3转换数据
  * @rmtoll   ACQ3_DR    RESULT    FL_ADC_ReadACQ3ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ3ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ4转换数据
  * @rmtoll   SCANACQ_DR    RESULT    FL_ADC_ReadSCANACQConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadSCANACQConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SCANACQ_DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    获取SCAN_ACQ 通道ID
  * @rmtoll   SCANACQ_DR    CHID    FL_ADC_ReadSCANChannelID
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadSCANChannelID(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SCANACQ_DR, (0x1fU << 16U)) >> 16U);
}

/**
  * @}
  */

/** @defgroup ADC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ADC_CommonDeInit(void);
FL_ErrorStatus FL_ADC_CommonInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
void FL_ADC_CommonStructInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
FL_ErrorStatus  FL_ADC_DeInit(ADC_Type *ADCx);
FL_ErrorStatus FL_ADC_Init(ADC_Type *ADCx, FL_ADC_InitTypeDef  *ADC_InitStruct,uint32_t ACQx_ID);
void FL_ADC_StructInit(FL_ADC_InitTypeDef *ADC_InitStruct);


/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LF0XX_FL_ADC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-06-25*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
